#pragma once
#include <iostream>
using namespace std;
void menu()
{
	cout<<"==========矩阵运算小帮手==========" << endl;
	cout << "==========1.矩阵相加==========" << endl;
	cout << "==========2.矩阵相减==========" << endl;
	cout << "==========3.矩阵转置==========" << endl;
	cout << "==========4.矩阵相乘==========" << endl;
	cout << "==========5.矩阵求逆==========" << endl;
	cout << "==========6.离散数学板块==========" << endl;
	cout << "==========7.求解n阶行列式==========" << endl;
	cout << "==========0.退    出==========" << endl;
}
void Matrix_Multiplication_menu()
{
	cout << "===========矩阵乘法菜单===========" << endl;
	cout << "===========1.朴素算法===========" << endl;
	cout << "===========2.strassen算法===========" << endl;
	cout << "===========3.三元组算法===========" << endl;
}
void discrete_math_menu()
{
	cout << "==========关系矩阵求解闭包菜单==========" << endl;
	cout << "==========1.求解最小自反闭包==========" << endl;
	cout << "==========2.求解最小对称闭包==========" << endl;
	cout << "==========3.求解最小传递闭包(Warshall algorithm)==========" << endl;

}
